; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	satellite3 - satellite
	instrument3 - instrument
	satellite4 - satellite
	instrument4 - instrument
	image2 - mode
	spectrograph4 - mode
	image1 - mode
	thermograph0 - mode
	infrared3 - mode
	GroundStation0 - direction
	Star1 - direction
	Star5 - direction
	GroundStation6 - direction
	Star2 - direction
	Star4 - direction
	GroundStation3 - direction
	Phenomenon7 - direction
	Star8 - direction
	Phenomenon9 - direction
	Star10 - direction
	Planet11 - direction
)
(:init
	(supports instrument0 thermograph0)
	(supports instrument0 image1)
	(calibration_target instrument0 Star4)
	(calibration_target instrument0 Star5)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon9)
	(supports instrument1 image2)
	(supports instrument1 thermograph0)
	(supports instrument1 spectrograph4)
	(calibration_target instrument1 Star2)
	(calibration_target instrument1 GroundStation6)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star10)
	(supports instrument2 image2)
	(supports instrument2 infrared3)
	(supports instrument2 image1)
	(calibration_target instrument2 Star2)
	(on_board instrument2 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation6)
	(supports instrument3 thermograph0)
	(supports instrument3 image2)
	(calibration_target instrument3 Star4)
	(on_board instrument3 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star2)
	(supports instrument4 spectrograph4)
	(calibration_target instrument4 GroundStation3)
	(on_board instrument4 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Phenomenon7)
)
(:goal (and
	(pointing satellite2 Phenomenon9)
	(have_image Phenomenon7 image2)
	(have_image Star8 spectrograph4)
	(have_image Phenomenon9 spectrograph4)
	(have_image Star10 image1)
	(have_image Planet11 image2)
))

)

; plan
1. (turn_to satellite2 phenomenon9 groundstation6)
   deleted: (pointing satellite2 groundstation6)
   added: (pointing satellite2 phenomenon9)
   goals met: 1 of 6
2. (turn_to satellite1 groundstation6 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 groundstation6)
   goals met: 1 of 6
3. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 1 of 6
4. (calibrate satellite1 instrument1 groundstation6)
   added: (calibrated instrument1)
   goals met: 1 of 6
5. (turn_to satellite1 phenomenon7 groundstation6)
   deleted: (pointing satellite1 groundstation6)
   added: (pointing satellite1 phenomenon7)
   goals met: 1 of 6
6. (turn_to satellite0 star4 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 star4)
   goals met: 1 of 6
7. (take_image satellite1 phenomenon7 instrument1 image2)
   added: (have_image phenomenon7 image2)
   goals met: 2 of 6
8. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 2 of 6
9. (calibrate satellite0 instrument0 star4)
   added: (calibrated instrument0)
   goals met: 2 of 6
10. (turn_to satellite0 star10 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 star10)
   goals met: 2 of 6
11. (take_image satellite0 star10 instrument0 image1)
   added: (have_image star10 image1)
   goals met: 3 of 6
12. (turn_to satellite1 phenomenon9 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 phenomenon9)
   goals met: 3 of 6
13. (take_image satellite1 phenomenon9 instrument1 spectrograph4)
   added: (have_image phenomenon9 spectrograph4)
   goals met: 4 of 6
14. (turn_to satellite1 planet11 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 planet11)
   goals met: 4 of 6
15. (take_image satellite1 planet11 instrument1 image2)
   added: (have_image planet11 image2)
   goals met: 5 of 6
16. (turn_to satellite1 star8 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 star8)
   goals met: 5 of 6
17. (take_image satellite1 star8 instrument1 spectrograph4)
   added: (have_image star8 spectrograph4)
   goals met: 6 of 6
